stressTest.yml
config:
  target: 'https://clownfish-app-ualsn.ondigitalocean.app/'
  phases:
    - duration: 60  # Duration of the test in seconds
      arrivalRate: 10  # Number of new connections per second
  defaults:
    headers:
      User-Agent: 'Artillery WebSocket Test'

scenarios:
  - name: "Socket Test"
    engine: 'socketio'
    flow:
      - loop:
          - emit:
              channel: 'message'
              data: 'Hello, WebSocket Server!'
          - think: 1  # Wait for 1 second
        times: 10  # Number of times to repeat the loop