stressTest.yml
config:
  target: http://137.184.16.76:5000/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
      
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}

scenarios:
  - name: "Socket Test"
    engine: 'socketio'
    flow:
      - loop:
          - emit:
              channel: 'message'
              data: 'Hello, WebSocket Server!'
          - think: 1